---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.#ctor
source: html/efe9a7cd-06b3-4e9f-c8fc-8274dcb13f0d.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.#ctor Method

Constructs a default instance of vector settings.

## Syntax (C#)
```csharp
public AnalysisDisplayVectorSettings()
```